//----------------------------------------------------------------------------------------------------
#include <stdio.h>
#include <math.h>
//---------------------------------------------------------------------------------------------------
/*数式入力*/
void FormulaInput(char *Str){
    /*数式を入力してください*/
    printf("数式かコマンドを入力してください : ");

    /*英数字・記号 読み込み*/
    unsigned int i = 0;
    do{
    	Str[i] = getchar();
    } while(Str[i++] != 0x0A); //0x0A:Ent

    /*文字列の最後を必ず'='にする*/
    Str[i-1] = (Str[i-2] == '=' ? 0 :'=');
}
//----------------------------------------------------------------------------------------------------
/*桁管理*/
void NumSetup(int x,double *Num,int Time,int Flag,int DigitNum){
	if(Flag == 0)
		Num[Time] = Num[Time] * 10 + x;
	else
        Num[Time] += x * pow(10,-(DigitNum+1));
    return;
}
//----------------------------------------------------------------------------------------------------
/*注意書き*/
void CautionStatement(){
    printf("----------------------------------------------------------------------------------------------------\n");
    printf("計算機の使用方法\n\n");
    printf("式を入力後は '='を入力するか,'Ent'を押してください。\n\n");
    printf("使用できる数式記号 : '+' , '-' , '*' , '/' , '!' , '^' \n");
    printf("例 : 1+1 , 1-1 , 1*1 , 1/1 , 1! , 1^1 \n\n");

    printf("使用できる関数 : sin'deg' , s'deg' , cos'deg' , c'deg' , tan'deg' , t'deg'\n");
    printf("角度の範囲制限 : 0-360 \n");
    printf("例 : sin30 , cos60 , tan45 , s30 , c60 , t45\n\n");

    printf("前の式を引き続き使用する場合は '+', '-' , '*' ,'/'の記号から記入してください。\n");
    printf("例 : +1 , -1 , *1 , /1\n\n");

    printf("その他の機能\n");
    printf("例1 : sin45+cos45-tan45 (三角関数の四則演算)\n");
    printf("例2 : 'H' or 'h' , 'history' , 'History' コマンドで過去の数式/解を見ることができます。\n");
    printf("終了するときには 'end' または 'e'と入力してください。\n");
    printf("----------------------------------------------------------------------------------------------------\n");
    return;
}
//----------------------------------------------------------------------------------------------------
/*空白をなくし式を短くする*/
void Shorten(int *NumFlag, char *Sign, double *Num){
    for(int i = 0; ; i++){
        if(Sign[i] == '=')
            break;
        else
        if(NumFlag[i] == 0 && Sign[i] == 0){
            for(int j = i; ; j++){
                if(NumFlag[j] == 0 && Sign[j] == 0){
                    Num[j] = Num[j+1];
                    Num[j+1] = 0; 

                    NumFlag[j] = (NumFlag[j+1] == 1 ? 1 :0);
                    NumFlag[j+1] = 0;

                    Sign[j] = Sign[j+1];
                    Sign[j+1] = 0;
                    
                    if(Sign[j] == '=')
                        break;
                }
            }
        }
        if(Sign[i] == '=')
            break;
    }
    return;
}
//----------------------------------------------------------------------------------------------------